W3_Task3_displayLogin/app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'ibnu'
 LIMIT 1
---
    public function process()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)->first();